{
    "assessments": [
        {
            "assessmentId": "Intake-Business-Process-Analysis-Assessment-January-2025",
            "name": "Intake Customer Business Process Analysis Assessment Questionaire",
            "description": "Marketing, Communications, and Development groups collaborate to publish a quarterly update to the Customer Business Process Analysis Questionaire.",
            "questions": [
                "Instructions: Complete the questionnaire with answers about your businesses current processes and systems. If you are unsure about the question please skip the question and continue with the next question. A manager or information technology professional in your company may be able to provide answers. If there are any questions or concerns please email admin@TheIntellectTech.com.",
                "Does your team use a website or app to register customer information?",
                "Is the customer information stored in a system that allows updates to the information or system?",
                "Are there any processes that require sending digital information to customers or business systems?",
                "Does your business or team receive digital information from external business systems?",
                "Does your business have manual processes for information sharing (i.e. production of good and services, manufacturing, or health diagnosis and treatments)?",
                "Would you like to explore how to update legacy business infrastructure?",
                "Would you like to explore how to integrate business processes to simplify workflows?",
                "Would you like to explore innovative solutions for unique business models?",
                "Would you like to explore reducing friction for accessing digital resources?"
            ],
            "createdDate": "D20250101T11:00:00AM PST",
            "status": "new",
            "isActive": "true"
        },
        {
            "assessmentId": "Technology-Customer-Business-Process-Analysis-Research-Survey-January-2025",
            "name": "Technology Customer Business Process Analysis Research Survey",
            "description": "Marketing, Communications, and Development groups collaborate to publish a quarterly update to the Customer Business Process Analysis Research Survey.",
            "questions": [
                "Instructions: Complete the questionnaire with answers about your businesses current processes and systems. If you are unsure about the question please skip the question and continue with the next question. A manager or information technology professional in your company may be able to provide answers. If there are any questions or concerns please email admin@TheIntellectTech.com.",
                "Does your business use project management tools such as?",
                "Does your business use inventory management tools?",
                "Does your business have a product and services sales report?",
                "Does your business systems require updates to comply with new or changing policies or regulations?",
                "Does your business include equipment for manufacturing or production?",
                "Does your business use custom software for business operations or service delivery?",
                "Does your business participate in reporting, analysis, or long-term information storage?",
                "Does your company use third party software tools?",
                "Does your company use information processing tools?",
                "Does your company use ERP or CRM software tools?"
            ],
            "createdDate": "D20250101T11:00:00AM PST",
            "status": "new",
            "isActive": "true"
        },
        {
            "assessmentId": "Detailed-Technology-Customer-Solution-Analysis-Survey-January-2025",
            "name": "Detailed Technology Customer Solution Analysis Survey",
            "description": "In-depth technology research survey for gathering detailed responses related to current processes and systems used to suggest software solutions.",
            "questions": [
                "Instructions: As a first step we want to understand the company, business, business model, activities, and core systems that are used to perform business processes. This information is technical (especially for IT, Engineering, and Software groups), therefore a manager may have the knowledge required to answer the questions. There is a general purpose Customer Business Process Analysis Questionnaire for managers of non-technical business groups. Answer the following questions. Answers are used to develop a framework or outline for the problem definition. Add any additional info or comments to the notes section. Supplemental diagrams or overview documents email to admin@TheIntellectTech.com.",
                "What industry is the business: automotive, healthcare, manufacturing, government, etc.?",
                "Which model best describes the business systems? (i.e. manual paper-based processes for operations activities, manual paper-based processed integrated into software tools, digital workflows with multiple software tools, digital workflows in a single software or web tool, cloud platforms with complex business processes, data eco-system processing metrics analysis, monitoring and collecting signals from sensors or internet of things devices, or hardware interfaces for engine-based manufacturing equipment). Explain why this model best fits your business industry and service model.",
                "When were the most recent updates to the core systems? Describe the updates in phases and outcomes.",
                "How many people (personnel or employees) interact with the business systems?",
                "How long does it take to complete the processes for gathering, collecting, organizing, or transferring information within the core systems?",
                "Describe the full workflow for the core business system (beginning with the start of an activity or process to the completion of records processing).",
                "What are the three (3) wishes for system features? Desirable system features or feature improvements?",
                "What are the most important business functions within your team?",
                "How does the information transfer in each business function?",
                "Are there major bottlenecks in the processes for each function?",
                "Would your team benefit from a customized application to facilitate useful business functions or workflows? Yes or no and explain."
            ],
            "createdDate": "D20250101T11:00:00AM PST",
            "status": "new",
            "isActive": "true"
        },
        {
            "assessmentId": "Data-DMBOK2-Maturity-Assessment-January-2025",
            "name": "Data Management Body of Knowledge 2.0 (DMBOK2) Maturity Assessment Questionaire",
            "description": "The Data Management, Governance, Compliance or Security teams provide professional expertise on procedures, standards, and rules for managing business data throughout the lifecycle (from creation to disposal). This document is the Data Management Body of Knowledge 2.0 (DMBOK2) Maturity Assessment Questionnaire is updated annually by the governance committee. The purpose of the document is to assess a business’s data strategy and implementation levels using the DMBOK2 framework. Data engineers or compliance leads are responsible for completing the questions in this assessment and determining the level of data maturity in order to determine where to begin with strategies for data compliance readiness. After completing the assessment the goal is to provide services to assist with data compliance readiness.",
            "questions": [
                "Instructions: Use the maturity level scale (1. No strategy, 2. Concepts are in exploration phase with sparse management or strategy conversations, 3. Data strategies are in progress and being developed in practice, 4. Data management and strategy is defined with implemented processes and tools, 5. Strategies are data-driven, appropriate policies, continuous updates) rate the investment in the given data strategy areas.",
                "Does your business have one or more data architectures?",
                "Does your data engineering processes include data modeling and design?",
                "Does your business have data storage and management operations?",
                "Are the data systems using data security and privacy tools to prevent unauthorized access, misuse, or breaches?",
                "Does your business have data integration and interoperability processes?",
                "Does your business have document and content management tools or systems?",
                "Does your business have reference and master data models or databases?",
                "Rate your business investment in data warehousing and business intelligence.",
                "Does your business data include metadata for enhancing contextual meaning?",
                "Rate your business investment in data quality management.",
                "Rate your business investment in data classification.",
                "Rate your business investment in a data management strategy.",
                "Rate your business investment data valuation.",
                "Rate your business investment principles and ethics.",
                "Rate your business investment in data governance, and compliance strategy.",
                "Rate your business investment in culture change.",
                "Rate your business investment stewardship and ownership.",
                "Rate your business investment data governance policies."
            ],
            "createdDate":"D20250101T11:00:00AM PST",
            "status": "new",
            "isActive": "true"
        },
        {
            "assessmentId": "Data-DCAM2.2-Capability",
            "name": "Data Management Capabilities Assessment Model v2.2 (DCAM 2.2) Questionnaire",
            "description": "The Data Management Capabilities Assessment Model v2.2 (DCAM 2.2) Questionnaire is updated annually by the governance committee and provides a starting point for data management strategy and processes.",
            "questions": [
                "Instructions: Each question relates to a data management capability as defined in the DCAM 2.2 framework. Answer each question to the best of your knowledge.",
                "Is the data management strategy specified?",
                "Is the data management strategy shared with stakeholders and business groups?",
                "Is the data management strategy developed, documented and consolidated?",
                "Is the data management strategy aligned with high-level organizational objectives?",
                "Does the data management strategy include an approval process?",
                "Is the data management use case defined?",
                "Are the data management business requirements documented?",
                "Are the business requirements prioritized?",
                "Are the business requirements approved?",
                "Are the business requirements incorporated into the data management strategy?",
                "Does the data management use case map to the data management strategy?",
                "Does the data management use case align with the data management strategy?",
                "Are the expected outcomes defined in sequence of occurrence?",
                "Has the data management use case been reviewed by stakeholders?",
                "Has the data management use case been validated by stakeholders?",
                "Is the data management vision defined?",
                "Has the data content strategy been defined?",
                "Has the data usage strategy been defined?",
                "Has the data management deployment strategy been communicated?",
                "Is the data management program strategy and approach defined?",
                "Is the data management program strategy and approach adopted?",
                "Are the data management program operations established?",
                "Are the data management program operations roles and responsibilities defined?",
                "Are the data management program operations roles and responsibilities implemented?",
                "Are the data management program operations processes defined?",
                "Are the data management program processes operational?",
                "Does the data management program have the authority to enforce adherence and compliance?",
                "Is the data management program included in the data management strategy?",
                "Is the data management funding model established?",
                "Has the data management funding model been approved?",
                "Has the data management funding model been adopted?",
                "Is the data management funding model matched to business requirements?",
                "Is the data management funding model included in an implementation timeline?",
                "Is the data management funding model mapped to operational capabilities?",
                "Does the data management funding model align with the funding processes of the organization?",
                "Is the data management funding model implemented?",
                "Is the data management funding model implementation enforced?",
                "Is the data management organizational structure defined?",
                "Is the data management organizational structure implemented?",
                "Is the Office of Data Management (ODM) created?",
                "Does the ODM have an executive sponsor or lead?",
                "Is the ODM funded?",
                "Does the ODM have any staff?",
                "Do the ODM staff have the required skills?",
                "Are there data management program roadmaps?",
                "Do the data management program roadmaps align with the data management strategy?",
                "Are the data management program roadmaps shared with stakeholders and business groups?",
                "Are the data management program roadmaps approved?",
                "Have project plans with deliverables, timelines, and milestones been developed?",
                "Has a data management process excellence program been established?",
                "Are the data management process standards defined?",
                "Are the data management process standards implemented through the organization?",
                "Have the industry standards and best practices been considered in the data management process standards?",
                "Are the data management process included in policies?",
                "Are the data management processes auditable?",
                "Has stakeholder engagement been established?",
                "Is stakeholder engagement confirmed?",
                "Have stakeholders approved and committed to the data management program deliverables?",
                "Are the stakeholder accountable for the data management program deliverables?",
                "Do stakeholders have resource allocation plans for the data management program deliverables?",
                "Are the resource allocation plans aligned with project initiatives and requirements?",
                "Are resources including funds allocated, aligned with roadmaps and segmented into work streams?",
                "Are communications processes established?",
                "Are internal communication plans defined?",
                "Are internal communication plans approved?",
                "Are communications processes operational?",
                "Have external communications plans with regulatory bodies been defined?",
                "Have external communications plans with regulatory bodies been approved?",
                "Have training programs been designed and developed?",
                "Are training programs operational?",
                "Is the data management program measured for effectiveness?",
                "Is the data management program evaluated against business objectives?",
                "Have program metrics been defined?",
                "Are program metrics used to track progress?",
                "Have outcome metrics been defined?",
                "Are outcome metrics associated with business objectives?",
                "Have process metrics been defined?",
                "Are process metrics used to drive continuous improvement?",
                "Have financial metrics for costs versus benefits (ROI) been implemented?"
            ],
            "createdDate":"D20250101T11:00:00AM PST",
            "status": "new",
            "isActive": "true"
        },
        {
            "assessmentId": "Data-COBIT-Maturity-Assessment-January-2025",
            "name": "Control Objectives for Information and Related Technologies (COBIT) Data Maturity Assessment",
            "description": "",
            "questions": [],
            "createdDate":"D20250101T11:00:00AM PST",
            "status": "new",
            "isActive": "false"
        },
        {
            "assessmentId": "Data-COBIT-Quality-Assessment-January-2025",
            "name": "Control Objectives for Information and Related Technologies (COBIT) Data Quality Assessment",
            "description": "",
            "questions": [],
            "createdDate":"D20250101T11:00:00AM PST",
            "status": "new",
            "isActive": "false"
        },
        {
            "assessmentId": "Data-COBIT-Capability-Assessment-January-2025",
            "name": "Control Objectives for Information and Related Technologies (COBIT) Data Capability Assessment",
            "description": "",
            "questions": [],
            "createdDate":"D20250101T11:00:00AM PST",
            "status": "new",
            "isActive": "false"
        }
    ]
}